In [ ]:
import easyaccess as ea
import pandas as pd
import numpy as np

db = ea.connect(section = 'desoper')

cmd = 'create table lzullo.commentobs  \
       (\
          NAME       varchar2(80),  \
          COMMENTS    varchar2(80)   \
       )'

db = ea.connect(section='desoper')
cursor = db.cursor()
try:
    cursor.execute('drop table lzullo.commentobs')     # drop this table in case there was an existing copy
    cursor.execute(cmd)
except:
    cursor.execute(cmd)

In [13]:
result = db.query_to_pandas('select * from lzullo.commentobs')

result.head()

           NAME               COMMENTS
0          None                   None
1         Lynus  Hey this is a comment
2  Test Comment           Comment Here
3          None                   None
4         Colin            New Comment

In [8]:
cmds = ["INSERT INTO lzullo.commentobs (NAME, COMMENTS) \
VALUES ('Test Comment', 'Comment Here')"]

In [9]:
for c in cmds:
    cursor.execute(c)

In [10]:
result = db.query_to_pandas('select * from lzullo.commentobs')
result.head(len(result))

           NAME      COMMENTS
0  Test Comment  Comment Here

In [ ]:
cmd = 'create table lzullo.commentexp  \
       (\
          NAME       varchar2(80),  \
          COMMENTS    varchar2(80)   \
       )'

db = ea.connect(section='desoper')
cursor = db.cursor()
try:
    cursor.execute('drop table lzullo.commentexp')     # drop this table in case there was an existing copy
    cursor.execute(cmd)
except:
    cursor.execute(cmd)

result = db.query_to_pandas('select * from lzullo.commentexp')

result.head()

cmds = ["INSERT INTO lzullo.commentexp (NAME, COMMENTS) \
VALUES ('Test Comment', 'Comment Here')"]

for c in cmds:
    cursor.execute(c)

In [12]:
result = db.query_to_pandas('select * from lzullo.commentexp')
result.head(len(result))

           NAME               COMMENTS
0  Test Comment           Comment Here
1          None                   None
2         Lynus  Hey this is a comment
3          None                   None
4         Colin            New Comment
5          None                   None

In [34]:
result = db.query_to_pandas('select * from lzullo.commenttable')
result.head(len(result))

     NAME COMMENTS
0    None     None
1    None     None
2       a        a
3   Lynus        3
4   Lynus        1
5   Lynus        4
6    None     None
7   Lynus        2
8    None     None
9    None     None
10   None     None
11  Lynus        1
12   None     None
13   None     None
14   None     None
15   None     None

In [32]:
cmds = ["DELETE FROM lzullo.commenttable"]
for c in cmds:
    cursor.execute(c)
result = db.query_to_pandas('select * from lzullo.commenttable')
result.head(len(result))

Empty DataFrame
Columns: [NAME, COMMENTS]
Index: []

In [33]:
cmds = ["INSERT INTO lzullo.commenttable (NAME, COMMENTS) \
VALUES ('', '')"]
for c in cmds:
    cursor.execute(c)
result = db.query_to_pandas('select * from lzullo.commenttable')
result.head(len(result))

   NAME COMMENTS
0  None     None